Tekla Open API Reference for Tekla Structures 2025
Assembly.GetSecondaries Method
 Selects and returns all the secondary assemblables belonging to the assembly. The method replaces the old GetObjects() method. Notice that the number of secondaries is limited to 2048.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetSecondaries()
Public Function GetSecondaries As ArrayList
Return Value
Type: ArrayList
An array list containing all the secondary assemblables belonging to the assembly.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace